-- 变形形态
local ShapeshiftDefs = {
    {"猫", 1},
    {"熊", 5},
    {"SM狼", 16},
    {"树", 2},
    {"大飞", 27},
    {"旅行", 3},
    {"小飞", 29},
    {"水栖", 4},
    {"枭兽", 31},
}
IMT.ShapeshiftIDs, IMT.ShapeshiftOrder = BuildIDTable(ShapeshiftDefs)

-- 变形形态模型
local ShapeshiftModelDefs = {
    {"幽灵虎", 21974},
    {"幽灵狼", 21114},
    {"吉安娜", 30865},
    {"巫妖王", 24191},
    {"瓦王", 28127},
    {"伊利丹", 27571},
    {"祖格老虎BOSS", 15214},
    {"大脚", 31094},
    {"逐日", 29673},
    {"洛卡纳哈", 28010},
    {"小洛卡纳哈", 28649},
    {"古德利亚", 28871},
    {"小古德利亚", 28873},
    {"血月狼人", 26787},
    {"烈焰舞娘", 23732},
    {"诺格弗格药剂", 7550},
    {"幽灵狮鹫", 26691},
    {"凤凰", 17890},
    {"金色凤凰", 121416},
    {"祥云火鹰", 126079},
    {"火猫", 131379},
    {"萨尔", 27275},
    {"加尔鲁什", 28195},
    {"凯尔萨斯", 20063},
    {"阿尔萨斯（人类）", 29958},
    {"红色幼龙", 28047},
    {"时光迷失元龙", 31268},
}
IMT.ShapeshiftModelIDs, IMT.ShapeshiftModelOrder = BuildIDTable(ShapeshiftModelDefs)
