-- 技能效果
local SpellGroups = {
    {"近战AOE", {
        {"神圣风暴", 53385},
    }},
    {"BUFF特效", {
        {"狂野怒火（小红人）", 19574},
        {"血性狂怒（手红光）", 20572},
        {"光明使者（金光闪耀）", 73326},
        {"复仇之怒（天使翅膀）", 31884},
        {"守护之魂（翅膀）", 47788},
        {"冰霜之柱（冰蓝光环）", 51271},
        {"树皮术（绿光护体）", 22812},
        {"圣盾术（金光无敌）", 642},
        {"嗜血术（红色脉动）", 2825},
        {"战斗怒吼（红色怒吼）", 6673},
        {"神圣化身（金光形态）", 200183},
        {"白虎下凡（白虎幻影）", 123904},
        {"冰怒（冰蓝脉冲）", 210714},
    }},
    {"弹道技能", {
        {"混乱之箭（邪能飞弹）", 215279},
        {"熔岩爆裂（火红飞弹）", 285452},
        {"暗言术：灭（暗紫光球）", 32379},
        {"奥术弹幕（紫蓝飞弹）", 44425},
        {"暗影箭（暗影飞弹）", 686},
        {"黑冰箭（暗蓝飞弹）", 257537},
        {"吸取灵魂（暗紫光束）", 198590},
        {"心灵尖刺（暗紫射线）", 73510},
        {"雷霆之怒（闪电链）", 21992},
        {"毁灭闪电（闪电AOE）", 187874},
    }},
    {"远程AOE", {
        {"星落术（星辰坠落）", 191034},
        {"凋零缠绕（暗影冲击）", 445513},
        {"真言术：耀（圣光爆发）", 194509},
        {"治疗之雨（绿色飘散）", 73920},
        {"神圣新星（金圈扩散）", 132157},
        {"光晕（神圣光圈扩散）", 120517},
        {"瀑流（暗影波纹）", 121135},
        {"圣言术：灵（金光圣域）", 34861},
        {"圣光之锤（地面圣光）", 114158},
        {"毁灭之浪（邪能冲击）", 228853},
        {"枯萎凋零（暗影地面）", 43265},
        {"弹幕射击（弹幕射击）", 120360},
        {"恶魔之怒（绿色AOE）", 193439},
        {"引导恶魔之火（邪能射线）", 196447},
        {"邪能毁灭（地面邪能）", 212084},
        {"冰霜射线（蓝色光束）", 205021},
        {"鲜血与雷鸣（红雷）", 384277},
    }},
    {"其他特效", {
        {"橙斧鬼影", 72523},
        {"暗影信标", 64465},
        {"腐臭蜂群（暗影冲击）", 34240},
        {"腐臭蜂群（小型）", 37779},
        {"狂野的猴子（气泡）", 48332},
        {"神圣赞美诗（音符环绕）", 64843},
        {"寒冰屏障（冰块封体）", 45438},
        {"伊利达雷之怒（恶魔旋风）", 201789},
        {"邪能爆发（邪能刺穿）", 211881},
        {"血魔之握（暗影触须拉人）", 108199},
        {"风暴之锤（圣光投锤）", 107570},
        {"火焰冲击（火球飞射）", 319836},
        {"怒雷破（武僧拳风）", 113656},
        {"圣洁鸣钟（圣光钟声）", 375576},
        {"新月（月光打击）", 274281},
        {"牺牲祝福（金色连线）", 199448},
        {"妖术（变青蛙）", 51514},
        {"再生（绿色引导）", 291944},
    }},
}
IMT.SpellNames = {}
IMT.SpellOrder = {}
for _, group in ipairs(SpellGroups) do
    for _, spell in ipairs(group[2]) do
        IMT.SpellNames[spell[1]] = spell[2]
        table.insert(IMT.SpellOrder, spell[1])
    end
end
IMT.SpellGroups = SpellGroups
